remove([A|B], A, B).
remove([S|C], A, [S|B]) :- remove(C, A, B).

permute([], []).
permute(L, [X|T]) :- remove(L, X, E), permute(E, T).


решение1(Леонид, Михаил, Николай, Олег, Петр) :- permute(['Атаров', 'Бартенев', 'Кленов', 'Данилин', 'Иванов'], [Леонид, Михаил, Николай, Олег, Петр]),

    not(он(Николай, 'Иванов')),
    not(он(Николай, 'Кленов')),
    not(он(Николай, 'Данилин')),
    not(он(Петр, 'Кленов')),
    not(он(Петр, 'Бартенев')),
    not(он(Михаил, 'Кленов')),
    он(Михаил, 'Бартенев'),
    not(он(Михаил, 'Данилин')),
    not(он(Олег, 'Кленов')),
    not(он(Олег, 'Данилин')),
    not(он(Леонид, 'Бартенев')),
    not(он(Леонид, 'Атаров')).

он(Он, Он).

решение2(Леонид, Михаил, Николай, Олег, Петр) :-

    write([Михаил, [Николай, Олег]]),
    write('\n'), 
    write([Петр, [Олег, Николай, Леонид]]),
    write('\n'), 
    write([Леонид, [Петр]]), 
    write('\n'), 
    write([Николай, [Петр, Олег, Михаил]]),
    write('\n'), 
    write([Олег, [Петр, Михаил, Николай]]).
